Revit 2026 API

# IDuplicateTypeNamesHandler Methods

---

The IDuplicateTypeNamesHandler type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OnDuplicateTypeNamesFound | Called when the destination document contains types with the same names as the types being copied. |

#### Reference

IDuplicateTypeNamesHandler Interface

Autodesk.Revit.DB Namespace